docs/news/index.html
<!DOCTYPE html>
<html lang="en">
<head>
<!-- 2021-02-02 -->
<meta charset="utf-8">
<meta name="viewport" content="width=device-width, initial-scale=1">
<title>News Index</title>
<meta name="generator" content="Org mode">
<link rel="stylesheet" type="text/css" href="/style.css">
</head>
<body>
<div id="preamble" class="status">
<nav id="navbar">
    <a href="/" class=navbartitle>Carbs Linux</a>

    <label for="hamburger">&#9776;</label>
    <input type="checkbox" id="hamburger" />
    <ul id=navbarlist>
        <li><a href="/" title="Home Page">Home</a></li>
        <li><a href="//git.carbslinux.org" title="Git Repository">Git</a></li>
        <li><a href="/download.html" title="Download Carbs Linux">Download</a></li>
        <li><a href="/blog" title="Blog Posts">Blog</a></li>
        <li><a href="/install.html" title="Installation Instructions">Installation</a></li>
        <li><a href="/docs.html" title="Documentation">Docs</a></li>
    </ul>
</nav>
</div>
<div id="content">
<header>
<h1 class="title">News Index</h1>
</header>
<div id="outline-container-org3c9305c" class="outline-2">
<h2 id="org3c9305c"><a href="20200916.html">Sep 16, 2020</a></h2>
<div class="outline-text-2" id="text-org3c9305c">
<p>
The libressl "revert" was reverted. System update will replace libressl
dependencies with bearssl. You may choose to keep or remove bearssl after the
update.
</p>
</div>
</div>
<div id="outline-container-orgad2f743" class="outline-2">
<h2 id="orgad2f743"><a href="20200903.html">Sep 03, 2020</a></h2>
<div class="outline-text-2" id="text-orgad2f743">
<p>
The default TLS provider has been reverted to <code>libressl</code>. System update will
replace bearssl dependencies with libressl. You may choose to keep or remove
bearssl after the update.
</p>
</div>
</div>
<div id="outline-container-orgbf4a227" class="outline-2">
<h2 id="orgbf4a227"><a href="20200727.html">Jul 27, 2020</a></h2>
<div class="outline-text-2" id="text-orgbf4a227">
<p>
Carbs Linux's fork of the <code>kiss</code> package manager has been renamed to <code>Carbs
  Packaging Tools</code> due to huge amount of changes. Your latest <code>kiss</code> update will
handle the bootstrapping. You will need to rename your <code>KISS-*</code> variables to
<code>CPT-*</code>.
</p>
</div>
</div>
<div id="outline-container-org96916e3" class="outline-2">
<h2 id="org96916e3"><a href="20200617.html">Jun 17, 2020</a></h2>
<div class="outline-text-2" id="text-org96916e3">
<p>
A new rootfs tarball including the changes to the core is released and can be
found on the downloads page.
</p>
</div>
</div>
<div id="outline-container-org8d83def" class="outline-2">
<h2 id="org8d83def"><a href="20200526.html">May 26, 2020</a></h2>
<div class="outline-text-2" id="text-org8d83def">
<p>
An initial version for binary package management is released. It can be found on
the <a href="https://github.com/CarbsLinux/kiss-bin">GitHub page</a>.
</p>
</div>
</div>
<div id="outline-container-org860ded3" class="outline-2">
<h2 id="org860ded3"><a href="20200519.html">May 19, 2020</a></h2>
<div class="outline-text-2" id="text-org860ded3">
<p>
A rootfs tarball targeting the i686 architecture has been released. It can be
found on the downloads page.
</p>
</div>
</div>
<div id="outline-container-org912039c" class="outline-2">
<h2 id="org912039c"><a href="20200510.html">May 10, 2020</a></h2>
<div class="outline-text-2" id="text-org912039c">
<p>
A GCC 10.1.0 change causes a kernel panic for kernels built with GCC 10.1. This
issue can be resolved by applying this <a href="https://git.kernel.org/pub/scm/linux/kernel/git/tip/tip.git/patch/?id=f670269a42bfdd2c83a1118cc3d1b475547eac22">patch</a> to your kernel sources.
</p>

<p>
<b><b>EDIT:</b></b> The patch is no longer necessary.
</p>
</div>
</div>
<div id="outline-container-org908d8bd" class="outline-2">
<h2 id="org908d8bd"><a href="20200427.html">Apr 27, 2020</a></h2>
<div class="outline-text-2" id="text-org908d8bd">
<p>
A new rootfs tarball has been released! You can see it on
<a href="https://dl.carbslinux.org/releases">https://dl.carbslinux.org/releases</a>!
</p>

<p>
<b><b>EDIT:</b></b> A new bug fix release has been made.
</p>
</div>
</div>
<div id="outline-container-org7b5abe2" class="outline-2">
<h2 id="org7b5abe2"><a href="20200410.html">Apr 10, 2020</a></h2>
<div class="outline-text-2" id="text-org7b5abe2">
<p>
IRC channel can now be accessed from <code>#carbslinux</code> at freenode!
</p>
</div>
</div>
<div id="outline-container-org12491b8" class="outline-2">
<h2 id="org12491b8"><a href="20200406.html">Apr 06, 2020</a></h2>
<div class="outline-text-2" id="text-org12491b8">
<p>
A new rootfs tarball has been released. See the downloads page.
</p>
</div>
</div>
<div id="outline-container-orge4410d2" class="outline-2">
<h2 id="orge4410d2"><a href="20200405.html">Apr 05, 2020</a></h2>
<div class="outline-text-2" id="text-orge4410d2">
<p>
Carbs Linux repositories will be hosted only on Github. Commits will be pushed
there, and not the repository. You have until May 4, 2020 Monday to switch your
remotes to <a href="https://github.com/CarbsLinux/repository">https://github.com/CarbsLinux/repository</a>. The git repository will
continue to be served until then (without additional commits).
</p>

<p>
You can switch your remote by executing the following command on your repository
directory.
</p>

<div class="org-src-container">
<pre class="src src-sh">git remote set-url origin https://github.com/CarbsLinux/repository
</pre>
</div>
</div>
</div>
<div id="outline-container-orgc0fb865" class="outline-2">
<h2 id="orgc0fb865"><a href="20200218.html">Feb 18, 2020</a></h2>
<div class="outline-text-2" id="text-orgc0fb865">
<p>
A new tarball is released. It can be found on <a href="https://dl.carbslinux.org">https://dl.carbslinux.org</a>.
</p>

<p>
<b><b>edit:</b></b> I have removed the tarball because of a bootstrapping issue. I will be
re-adding it later today.
</p>

<p>
<b><b>edit 2:</b></b> I have added a tarball (20200219) to reflect my recent changes on
Busybox.
</p>
</div>
</div>
<div id="outline-container-org84ca12e" class="outline-2">
<h2 id="org84ca12e"><a href="20200214.html">Feb 14, 2020</a></h2>
<div class="outline-text-2" id="text-org84ca12e">
<p>
<b><b>IMPORTANT!</b></b> Carbs-init update to be released on 17th of February
will require manual intervention. I am holding this update back so
people can see it before they update their system (even though the
update will show the same message as this). The rationale for the
update is explained below the intervention.
</p>

<div class="org-src-container">
<pre class="src src-sh"><span class="org-comment-delimiter"># </span><span class="org-comment">There is an explanation for each init You only need to follow the instructions</span>
<span class="org-comment-delimiter"># </span><span class="org-comment">for your own init-system</span>

<span class="org-comment-delimiter">## </span><span class="org-comment">busybox-init</span>
<span class="org-comment-delimiter"># </span><span class="org-comment">If you did not edit your inittab simply move inittab.new to inittab</span>
mv /etc/inittab.new /etc/inittab

<span class="org-comment-delimiter"># </span><span class="org-comment">If you did edit your inittab you can use a simple sed command to remove the</span>
<span class="org-comment-delimiter"># </span><span class="org-comment">necessary lines</span>
sed -i <span class="org-string">'/getty/d;/runsvdir/d'</span> /etc/inittab


<span class="org-comment-delimiter">## </span><span class="org-comment">runit</span>
<span class="org-comment-delimiter"># </span><span class="org-comment">same as busybox-init, if you did not edit /etc/runit/2 move 2.new to 2</span>
mv /etc/runit/2.new /etc/runit/2

<span class="org-comment-delimiter"># </span><span class="org-comment">else</span>
vim /etc/runit/2
<span class="org-comment-delimiter"># </span><span class="org-comment">open your 2 file and remove the for loop containing getty commands. If you are</span>
<span class="org-comment-delimiter"># </span><span class="org-comment">using runit, it is recommended to comment out /etc/init/runit.boot</span>

<span class="org-comment-delimiter">## </span><span class="org-comment">sinit/minit</span>
<span class="org-comment-delimiter"># </span><span class="org-comment">If you did not edit your {sinit-,}launch-services.boot you can simply remove</span>
<span class="org-comment-delimiter"># </span><span class="org-comment">it.</span>
rm -f /etc/init/launch-services.boot /etc/init/sinit-launch-services.boot

<span class="org-comment-delimiter"># </span><span class="org-comment">This should leave you without any issues, and you can safely reboot.</span>
</pre>
</div>

<p>
Carbs-init update is to make sure init systems do not clash, and do
not have to use different files. This is a sensible update both for
the user user and for the maintainer side. 
</p>

<p>
To give an example, before this update busybox-init was managing getty
through <code>inittab</code>, runit was managing through <code>/etc/runit/2</code>, and
minit/sinit were launching from <code>/etc/init/launch-services.boot</code>. This
is a configuration nightmare for everyone, and since I am maintaining
and constantly testing those init providers, a huge nightmare for me. 
This is a Quality of Life update.
</p>
</div>
</div>
</div>
<div id="postamble" class="status">
<footer>
    <p>Linux&reg; is a registered trademark of Linus Torvalds</p>
    <p>Copyright &copy; 2019-2021 Cem Keylan</p>
</footer>
</div>
</body>
</html>
